cf_billing/Documents/бестРеализацияЮрЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бестРеализацияЮрЛица</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.бестАвансы</xr:Item>
				<xr:Item>AccumulationRegister.бестАвансыИспользованные</xr:Item>
				<xr:Item>AccumulationRegister.бестВзаиморасчётыПоУслугамЮрЛица</xr:Item>
				<xr:Item>AccumulationRegister.бестСуммаРеализации</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаФактическогоСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументПерезаполнен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидВыгрузки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бестТипыВыгрузкиДанныхПоНачислениямФЛВУчетнуюСистему</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>7</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>11</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>9</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>9</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поставщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НДСВнутри</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>9</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДокументыОснования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДокументОснование</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.бестНачислениеПоДолевымСхемам</v8:Type>
								<v8:Type>cfg:DocumentRef.бестНачислениеНП</v8:Type>
								<v8:Type>cfg:DocumentRef.энргРаспределениеПомещения</v8:Type>
								<v8:Type>cfg:DocumentRef.энргНачислениеПени</v8:Type>
								<v8:Type>cfg:DocumentRef.бестНачислениеПениНП</v8:Type>
								<v8:Type>cfg:DocumentRef.энргНачислениеДляЛьготныхЛиц</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:DocumentRef.энргНачислениеПоРассрочке</v8:Type>
								<v8:Type>cfg:DocumentRef.энргНачисление</v8:Type>
								<v8:Type>cfg:DocumentRef.энргПерерасчет</v8:Type>
								<v8:Type>cfg:DocumentRef.бестПерерасчетНП</v8:Type>
								<v8:Type>cfg:DocumentRef.бестНачислениеПоСхемамСтруктурыСети</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf_billing/InformationRegisters/бестНомераСчетовФактурНачисленийЮрЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестНомераСчетовФактурНачисленийЮрЛиц</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НомерСФ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСФ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Начисление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/ОтветственныеЛицаОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ОтветственныеЛицаОрганизаций</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиОрганизации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОтветственноеЛицо</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОтветственныеЛицаОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/Enums/бестСтавкиНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бестСтавкиНДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НДС18</Name>
					<Comment>Ставка НДС 18%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС18_118</Name>
					<Comment>Расчетная ставка НДС 18/118</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС10</Name>
					<Comment>Ставка НДС 10%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС10_110</Name>
					<Comment>Расчетная ставка НДС 10/110</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС0</Name>
					<Comment>Ставка НДС 0%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС20</Name>
					<Comment>Ставка НДС 20%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС20_120</Name>
					<Comment>Расчетная ставка НДС 20/120</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС5</Name>
					<Comment>Ставка НДС 5%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС5_105</Name>
					<Comment>Расчетная ставка НДС 5/105</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС7</Name>
					<Comment>Ставка НДС 7%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС7_107</Name>
					<Comment>Расчетная ставка НДС 7/107</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС22</Name>
					<Comment>Ставка НДС 22%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС22_122</Name>
					<Comment>Расчетная ставка НДС 22/122</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf_billing/Enums/ОтветственныеЛицаОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ОтветственныеЛицаОрганизаций</Name>
			<Comment>(Регл)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Руководитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГлавныйБухгалтер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РуководительКадровойСлужбы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кассир</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветственныйЗаБухгалтерскиеРегистры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветственныйЗаНалоговыеРегистры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УполномоченныйПредставитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исполнитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветственныйЗаВУР</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf_billing/Catalogs/БанковскиеСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>БанковскиеСчета</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Организации</xr:Item>
				<xr:Item>Catalog.энргКонтрагенты</xr:Item>
				<xr:Item>Catalog.энргЗоныОтвественности</xr:Item>
				<xr:Item>Catalog.энргФилиалы</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерСчета</Name>
					<Comment>Номер расчетного счета</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Банк</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторБанков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерИДатаРазрешения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОткрытия</Name>
					<Comment>Дата открытия счета</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Comment>Дата закрытия счета</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанкДляРасчетов</Name>
					<Comment>Банк, в случае непрямых расчетов</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторБанков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСчета</Name>
					<Comment>Расчетный, депозитный, ссудный, иной</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстКорреспондента</Name>
					<Comment>Текст "Плательщик\Получатель" в платежных документах</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстНазначения</Name>
					<Comment>Текст назначения платежа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>210</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МесяцПрописью</Name>
					<Comment>Указывать в дате документа месяц прописью</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаБезКопеек</Name>
					<Comment>Указывать сумму без копеек, если она в целых рублях</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВсегдаУказыватьКПП</Name>
					<Comment>Всегда указывать КПП в платежных документах</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучноеИзменениеРеквизитовБанка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf_billing/Documents/бестРеализацияЮрЛица/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет список команд отчетов.
// 
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - состав полей см. в функции МенюОтчеты.СоздатьКоллекциюКомандОтчетов.
//   Параметры		- Структура передаваемых параметров.
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры= Неопределено) Экспорт
	
	//КомандаОтчет 									= КомандыОтчетов.Добавить();	
	//КомандаОтчет.Идентификатор 						= Метаданные.Отчеты.энргПредполагаемыеНачисленияАбонента.ПолноеИмя();
	//КомандаОтчет.Представление 						= НСтр("ru = 'Предполагаемые начисления'");
	//КомандаОтчет.Порядок      						= 50;
	////КомандаОтчет.РежимИспользованияПараметра 		= РежимИспользованияПараметраКоманды.Одиночный;
	////	КомандаОтчет.МестоРазмещенияКоманды 			= "ПодменюОтчетыСмТакже";
	//КомандаОтчет.ФункциональныеОпции 				= "";
	//КомандаОтчет.Картинка 							= БиблиотекаКартинок.ВидРасчета;
	
КонецПроцедуры

Функция ПолучениеДанныхАктаВыполненныхРабот(МассивДок, ДатаПечати)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивДок", 	МассивДок);
	Запрос.УстановитьПараметр("Дата", 		ДатаПечати);
	Запрос.Текст = "ВЫБРАТЬ
	|	бестРеализацияЮрЛица.Организация КАК Организация,
	|	бестРеализацияЮрЛица.Район КАК Район,
	|	бестРеализацияЮрЛица.Договор КАК Договор,
	|	бестРеализацияЮрЛица.Контрагент КАК Контрагент,
	|	бестРеализацияЮрЛицаУслуги.Услуга КАК Услуга,
	|	бестРеализацияЮрЛицаУслуги.Количество КАК Количество,
	|	бестРеализацияЮрЛицаУслуги.Цена КАК Цена,
	|	бестРеализацияЮрЛицаУслуги.Сумма КАК Сумма,
	|	ВЫБОР
	|		КОГДА бестРеализацияЮрЛицаУслуги.НДС = ЗНАЧЕНИЕ(Перечисление.бестСтавкиНДС.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.бестСтавкиНДС.НДС20)
	|		ИНАЧЕ бестРеализацияЮрЛицаУслуги.НДС
	|	КОНЕЦ КАК НДС,
	|	бестРеализацияЮрЛицаУслуги.СуммаНДС КАК СуммаНДС,
	|	бестРеализацияЮрЛица.Ссылка КАК Ссылка,
	|	бестРеализацияЮрЛицаУслуги.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	|ПОМЕСТИТЬ ВрТ0
	|ИЗ
	|	Документ.бестРеализацияЮрЛица.Услуги КАК бестРеализацияЮрЛицаУслуги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестРеализацияЮрЛица КАК бестРеализацияЮрЛица
	|		ПО бестРеализацияЮрЛицаУслуги.Ссылка = бестРеализацияЮрЛица.Ссылка
	|ГДЕ
	|	бестРеализацияЮрЛица.Ссылка В(&МассивДок)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВрТ0.Организация КАК Организация,
	|	ВрТ0.Район КАК Район,
	|	ВрТ0.Договор КАК Договор,
	|	ВрТ0.Контрагент КАК Контрагент,
	|	ВрТ0.Услуга КАК Услуга,
	|	СУММА(ВрТ0.Количество) КАК Количество,
	|	ВрТ0.Цена КАК Цена,
	|	СУММА(ВрТ0.Сумма) КАК Сумма,
	|	ВрТ0.НДС КАК НДС,
	|	СУММА(ВрТ0.СуммаНДС) КАК СуммаНДС,
	|	бестНомераСчетовФактурНачисленийЮрЛиц.НомерСФ КАК НомерСФ,
	|	бестНомераСчетовФактурНачисленийЮрЛиц.ДатаСФ КАК ДатаСФ,
	|	бестНомераСчетовФактурНачисленийЮрЛиц.IDАктаВыполненныхРабот КАК IDАктаВыполненныхРабот,
	|	бестНомераСчетовФактурНачисленийЮрЛиц.НомерАктаВыполненныхРабот КАК НомерАктаВыполненныхРабот,
	|	бестНомераСчетовФактурНачисленийЮрЛиц.ДатаАктаВыполненныхРабот КАК ДатаАктаВыполненныхРабот,
	|	бестНомераСчетовФактурНачисленийЮрЛиц.НомерСчетаНаОплату КАК НомерСчетаНаОплату,
	|	бестНомераСчетовФактурНачисленийЮрЛиц.ДатаСчетаНаОплату КАК ДатаСчетаНаОплату,
	|	ВрТ0.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВрТ0.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВрТ1
	|ИЗ
	|	ВрТ0 КАК ВрТ0
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестНомераСчетовФактурНачисленийЮрЛиц КАК бестНомераСчетовФактурНачисленийЮрЛиц
	|		ПО ВрТ0.Организация = бестНомераСчетовФактурНачисленийЮрЛиц.Организация
	|			И ВрТ0.Ссылка = бестНомераСчетовФактурНачисленийЮрЛиц.Начисление
	|
	|СГРУППИРОВАТЬ ПО
	|	ВрТ0.НДС,
	|	ВрТ0.Договор,
	|	ВрТ0.Услуга,
	|	ВрТ0.Контрагент,
	|	ВрТ0.Организация,
	|	ВрТ0.Район,
	|	бестНомераСчетовФактурНачисленийЮрЛиц.ДатаСчетаНаОплату,
	|	бестНомераСчетовФактурНачисленийЮрЛиц.НомерСФ,
	|	бестНомераСчетовФактурНачисленийЮрЛиц.НомерСчетаНаОплату,
	|	бестНомераСчетовФактурНачисленийЮрЛиц.ДатаСФ,
	|	бестНомераСчетовФактурНачисленийЮрЛиц.НомерАктаВыполненныхРабот,
	|	бестНомераСчетовФактурНачисленийЮрЛиц.IDАктаВыполненныхРабот,
	|	бестНомераСчетовФактурНачисленийЮрЛиц.ДатаАктаВыполненныхРабот,
	|	ВрТ0.Цена,
	|	ВрТ0.ЕдиницаИзмерения,
	|	ВрТ0.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВрТ1.Организация КАК Организация,
	|	ВрТ1.Район КАК Район,
	|	ВрТ1.Договор КАК Договор,
	|	ВрТ1.Контрагент КАК Контрагент,
	|	ВрТ1.Услуга КАК Услуга,
	|	ВрТ1.Количество КАК Количество,
	|	ВрТ1.Цена КАК Цена,
	|	ВрТ1.Сумма КАК Сумма,
	|	ВрТ1.НДС КАК НДС,
	|	ВрТ1.СуммаНДС КАК СуммаНДС,
	|	ВрТ1.НомерСФ КАК НомерСФ,
	|	ВрТ1.ДатаСФ КАК ДатаСФ,
	|	ВрТ1.IDАктаВыполненныхРабот КАК IDАктаВыполненныхРабот,
	|	ВрТ1.НомерАктаВыполненныхРабот КАК НомерАктаВыполненныхРабот,
	|	ВрТ1.ДатаАктаВыполненныхРабот КАК ДатаАктаВыполненныхРабот,
	|	ВрТ1.НомерСчетаНаОплату КАК НомерСчетаНаОплату,
	|	ВрТ1.ДатаСчетаНаОплату КАК ДатаСчетаНаОплату,
	|	ВрТ1.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЕСТЬNULL(бестНаименованияОрганизацийДляПечатиСрезПоследних.НаименованиеПолное, ВрТ1.Организация) КАК ОрганизацияНаименование,
	|	ЕСТЬNULL(бестНаименованияКонтрагентовДляПечатиСрезПоследних.НаименованиеПолное, ВрТ1.Контрагент) КАК КонтрагентНаименование,
	|	ВрТ1.Ссылка КАК Ссылка,
	|	бестНаименованияОрганизацийДляПечатиСрезПоследних.КонтрагентДляВыставленияПД КАК КонтрагентДляВыставленияПД
	|ПОМЕСТИТЬ ВрТ3
	|ИЗ
	|	ВрТ1 КАК ВрТ1
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестНаименованияОрганизацийДляПечати.СрезПоследних(&Дата, ) КАК бестНаименованияОрганизацийДляПечатиСрезПоследних
	|		ПО ВрТ1.Организация = бестНаименованияОрганизацийДляПечатиСрезПоследних.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестНаименованияКонтрагентовДляПечати.СрезПоследних(&Дата, ) КАК бестНаименованияКонтрагентовДляПечатиСрезПоследних
	|		ПО ВрТ1.Контрагент = бестНаименованияКонтрагентовДляПечатиСрезПоследних.Контрагент
	|
	|СГРУППИРОВАТЬ ПО
	|	ВрТ1.Район,
	|	ВрТ1.Контрагент,
	|	ВрТ1.НДС,
	|	ВрТ1.Организация,
	|	ВрТ1.Услуга,
	|	ВрТ1.Договор,
	|	ВрТ1.ДатаСФ,
	|	ВрТ1.IDАктаВыполненныхРабот,
	|	ВрТ1.ЕдиницаИзмерения,
	|	ВрТ1.НомерСчетаНаОплату,
	|	ВрТ1.ДатаАктаВыполненныхРабот,
	|	ВрТ1.НомерАктаВыполненныхРабот,
	|	ВрТ1.НомерСФ,
	|	ВрТ1.ДатаСчетаНаОплату,
	|	ЕСТЬNULL(бестНаименованияОрганизацийДляПечатиСрезПоследних.НаименованиеПолное, ВрТ1.Организация),
	|	ЕСТЬNULL(бестНаименованияКонтрагентовДляПечатиСрезПоследних.НаименованиеПолное, ВрТ1.Контрагент),
	|	ВрТ1.Количество,
	|	ВрТ1.Цена,
	|	ВрТ1.Сумма,
	|	ВрТ1.СуммаНДС,
	|	ВрТ1.Ссылка,
	|	бестНаименованияОрганизацийДляПечатиСрезПоследних.КонтрагентДляВыставленияПД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргКонтрагенты.Ссылка КАК Контрагент,
	|	энргКонтрагенты.ИНН КАК ИНН,
	|	энргКонтрагенты.КПП КАК КПП,
	|	ЕСТЬNULL(ВЫРАЗИТЬ(бестНаименованияКонтрагентовДляПечатиСрезПоследних.НаименованиеПолное КАК СТРОКА(1024)), """") КАК НаименованиеПолное,
	|	ЕСТЬNULL(ВЫРАЗИТЬ(бестНаименованияКонтрагентовДляПечатиСрезПоследних.НаименованиеСокращённое КАК СТРОКА(512)), """") КАК НаименованиеСокращённое
	|ПОМЕСТИТЬ СпрКонтрагенты
	|ИЗ
	|	РегистрСведений.бестНаименованияКонтрагентовДляПечати.СрезПоследних(&Дата, ) КАК бестНаименованияКонтрагентовДляПечатиСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргКонтрагенты КАК энргКонтрагенты
	|		ПО бестНаименованияКонтрагентовДляПечатиСрезПоследних.Контрагент = энргКонтрагенты.Ссылка
	|ГДЕ
	|	НЕ энргКонтрагенты.ПометкаУдаления
	|
	|СГРУППИРОВАТЬ ПО
	|	энргКонтрагенты.Ссылка,
	|	энргКонтрагенты.ИНН,
	|	энргКонтрагенты.КПП,
	|	ЕСТЬNULL(ВЫРАЗИТЬ(бестНаименованияКонтрагентовДляПечатиСрезПоследних.НаименованиеПолное КАК СТРОКА(1024)), """"),
	|	ЕСТЬNULL(ВЫРАЗИТЬ(бестНаименованияКонтрагентовДляПечатиСрезПоследних.НаименованиеСокращённое КАК СТРОКА(512)), """")
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВрТ3.Организация КАК Организация,
	|	ВрТ3.Район КАК Район,
	|	ВрТ3.Договор КАК Договор,
	|	ВрТ3.Контрагент КАК Контрагент,
	|	ВрТ3.Услуга КАК Услуга,
	|	ВрТ3.Количество КАК Количество,
	|	ВрТ3.Цена КАК Цена,
	|	ВрТ3.Сумма КАК Сумма,
	|	ВрТ3.НДС КАК НДС,
	|	ВрТ3.СуммаНДС КАК СуммаНДС,
	|	ВрТ3.НомерСФ КАК НомерСФ,
	|	ВрТ3.ДатаСФ КАК ДатаСФ,
	|	ВрТ3.IDАктаВыполненныхРабот КАК IDАктаВыполненныхРабот,
	|	ВрТ3.НомерАктаВыполненныхРабот КАК НомерАктаВыполненныхРабот,
	|	ВрТ3.ДатаАктаВыполненныхРабот КАК ДатаАктаВыполненныхРабот,
	|	ВрТ3.НомерСчетаНаОплату КАК НомерСчетаНаОплату,
	|	ВрТ3.ДатаСчетаНаОплату КАК ДатаСчетаНаОплату,
	|	ВрТ3.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	КонтрагентыПоставщики.НаименованиеПолное КАК ОрганизацияНаименование,
	|	КонтрагентыПокупатели.НаименованиеПолное КАК КонтрагентНаименование,
	|	ВрТ3.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВрТ4
	|ИЗ
	|	ВрТ3 КАК ВрТ3
	|		ЛЕВОЕ СОЕДИНЕНИЕ СпрКонтрагенты КАК КонтрагентыПоставщики
	|		ПО ВрТ3.КонтрагентДляВыставленияПД = КонтрагентыПоставщики.Контрагент
	|		ЛЕВОЕ СОЕДИНЕНИЕ СпрКонтрагенты КАК КонтрагентыПокупатели
	|		ПО ВрТ3.Контрагент = КонтрагентыПокупатели.Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВрТ4.Организация КАК Организация,
	|	ВрТ4.Договор КАК Договор,
	|	ВрТ4.НомерАктаВыполненныхРабот КАК НомерДок,
	|	ВрТ4.ДатаАктаВыполненныхРабот КАК ДатаДок,
	|	ВрТ4.ОрганизацияНаименование КАК ПредставлениеПоставщика,
	|	ВрТ4.КонтрагентНаименование КАК ПредставлениеПолучателя,
	|	ВрТ4.Ссылка КАК Ссылка
	|ИЗ
	|	ВрТ4 КАК ВрТ4
	|
	|СГРУППИРОВАТЬ ПО
	|	ВрТ4.КонтрагентНаименование,
	|	ВрТ4.ОрганизацияНаименование,
	|	ВрТ4.ДатаАктаВыполненныхРабот,
	|	ВрТ4.Ссылка,
	|	ВрТ4.НомерАктаВыполненныхРабот,
	|	ВрТ4.Организация,
	|	ВрТ4.Договор
	|ИТОГИ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВрТ3.Услуга КАК Услуга,
	|	СУММА(ВрТ3.Количество) КАК Количество,
	|	ВрТ3.Цена КАК Цена,
	|	СУММА(ВрТ3.Сумма) КАК Сумма,
	|	ВрТ3.НДС КАК НДС,
	|	СУММА(ВрТ3.СуммаНДС) КАК СуммаНДС,
	|	ВрТ3.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЕСТЬNULL(бестСоответствиеУслугНоменклатуре.Номенклатура, """") КАК НоменклатураНаименование,
	|	ВрТ3.Ссылка КАК Ссылка
	|ИЗ
	|	ВрТ3 КАК ВрТ3
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестСоответствиеУслугНоменклатуре КАК бестСоответствиеУслугНоменклатуре
	|		ПО ВрТ3.Организация = бестСоответствиеУслугНоменклатуре.Организация
	|			И ВрТ3.Услуга = бестСоответствиеУслугНоменклатуре.Услуга
	|
	|СГРУППИРОВАТЬ ПО
	|	ВрТ3.НДС,
	|	ВрТ3.Услуга,
	|	ВрТ3.ЕдиницаИзмерения,
	|	ЕСТЬNULL(бестСоответствиеУслугНоменклатуре.Номенклатура, """"),
	|	ВрТ3.Цена,
	|	ВрТ3.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВрТ3.Организация КАК Организация,
	|	ЕСТЬNULL(ОтветственныеЛицаОрганизацийСрезПоследних.Должность, """") КАК Должность,
	|	ЕСТЬNULL(ОтветственныеЛицаОрганизацийСрезПоследних.ФизическоеЛицо, """") КАК ФизЛицо
	|ИЗ
	|	ВрТ3 КАК ВрТ3
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(&Дата, ) КАК ОтветственныеЛицаОрганизацийСрезПоследних
	|		ПО ВрТ3.Организация = ОтветственныеЛицаОрганизацийСрезПоследних.СтруктурнаяЕдиница
	|			И (ОтветственныеЛицаОрганизацийСрезПоследних.ПравоПодписиПлатежныхДокументов)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВрТ3.Организация,
	|	ЕСТЬNULL(ОтветственныеЛицаОрганизацийСрезПоследних.Должность, """"),
	|	ЕСТЬNULL(ОтветственныеЛицаОрганизацийСрезПоследних.ФизическоеЛицо, """")
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	ФизЛицо
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Реализация = Запрос.ВыполнитьПакет();
	
	Возврат Реализация;
КонецФункции

Функция ПолучениеДанныхСчетаНаОплату(МассивДок, ДатаПечати)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивДок", 	МассивДок);
	Запрос.УстановитьПараметр("Дата", 		ДатаПечати);
	Запрос.Текст = "ВЫБРАТЬ
	|	бестРеализацияЮрЛица.Организация КАК Организация,
	|	бестРеализацияЮрЛица.Район КАК Район,
	|	бестРеализацияЮрЛица.Договор КАК Договор,
	|	бестРеализацияЮрЛица.Контрагент КАК Контрагент,
	|	бестРеализацияЮрЛицаУслуги.Услуга КАК Услуга,
	|	бестРеализацияЮрЛицаУслуги.Количество КАК Количество,
	|	бестРеализацияЮрЛицаУслуги.Цена КАК Цена,
	|	бестРеализацияЮрЛицаУслуги.Сумма КАК Сумма,
	|	ВЫБОР
	|		КОГДА бестРеализацияЮрЛицаУслуги.НДС = ЗНАЧЕНИЕ(Перечисление.бестСтавкиНДС.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.бестСтавкиНДС.НДС20)
	|		ИНАЧЕ бестРеализацияЮрЛицаУслуги.НДС
	|	КОНЕЦ КАК НДС,
	|	бестРеализацияЮрЛицаУслуги.СуммаНДС КАК СуммаНДС,
	|	бестРеализацияЮрЛица.Ссылка КАК Ссылка,
	|	бестРеализацияЮрЛицаУслуги.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	|ПОМЕСТИТЬ ВрТ0
	|ИЗ
	|	Документ.бестРеализацияЮрЛица.Услуги КАК бестРеализацияЮрЛицаУслуги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестРеализацияЮрЛица КАК бестРеализацияЮрЛица
	|		ПО бестРеализацияЮрЛицаУслуги.Ссылка = бестРеализацияЮрЛица.Ссылка
	|ГДЕ
	|	бестРеализацияЮрЛица.Ссылка В(&МассивДок)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВрТ0.Организация КАК Организация,
	|	ВрТ0.Район КАК Район,
	|	ВрТ0.Договор КАК Договор,
	|	ВрТ0.Контрагент КАК Контрагент,
	|	ВрТ0.Услуга КАК Услуга,
	|	СУММА(ВрТ0.Количество) КАК Количество,
	|	ВрТ0.Цена КАК Цена,
	|	СУММА(ВрТ0.Сумма) КАК Сумма,
	|	ВрТ0.НДС КАК НДС,
	|	СУММА(ВрТ0.СуммаНДС) КАК СуммаНДС,
	|	бестНомераСчетовФактурНачисленийЮрЛиц.НомерСФ КАК НомерСФ,
	|	бестНомераСчетовФактурНачисленийЮрЛиц.ДатаСФ КАК ДатаСФ,
	|	бестНомераСчетовФактурНачисленийЮрЛиц.IDАктаВыполненныхРабот КАК IDАктаВыполненныхРабот,
	|	бестНомераСчетовФактурНачисленийЮрЛиц.НомерАктаВыполненныхРабот КАК НомерАктаВыполненныхРабот,
	|	бестНомераСчетовФактурНачисленийЮрЛиц.ДатаАктаВыполненныхРабот КАК ДатаАктаВыполненныхРабот,
	|	бестНомераСчетовФактурНачисленийЮрЛиц.НомерСчетаНаОплату КАК НомерСчетаНаОплату,
	|	бестНомераСчетовФактурНачисленийЮрЛиц.ДатаСчетаНаОплату КАК ДатаСчетаНаОплату,
	|	ВрТ0.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВрТ0.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВрТ1
	|ИЗ
	|	ВрТ0 КАК ВрТ0
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестНомераСчетовФактурНачисленийЮрЛиц КАК бестНомераСчетовФактурНачисленийЮрЛиц
	|		ПО ВрТ0.Организация = бестНомераСчетовФактурНачисленийЮрЛиц.Организация
	|			И ВрТ0.Ссылка = бестНомераСчетовФактурНачисленийЮрЛиц.Начисление
	|
	|СГРУППИРОВАТЬ ПО
	|	ВрТ0.НДС,
	|	ВрТ0.Договор,
	|	ВрТ0.Услуга,
	|	ВрТ0.Контрагент,
	|	ВрТ0.Организация,
	|	ВрТ0.Район,
	|	бестНомераСчетовФактурНачисленийЮрЛиц.ДатаСчетаНаОплату,
	|	бестНомераСчетовФактурНачисленийЮрЛиц.НомерСФ,
	|	бестНомераСчетовФактурНачисленийЮрЛиц.НомерСчетаНаОплату,
	|	бестНомераСчетовФактурНачисленийЮрЛиц.ДатаСФ,
	|	бестНомераСчетовФактурНачисленийЮрЛиц.НомерАктаВыполненныхРабот,
	|	бестНомераСчетовФактурНачисленийЮрЛиц.IDАктаВыполненныхРабот,
	|	бестНомераСчетовФактурНачисленийЮрЛиц.ДатаАктаВыполненныхРабот,
	|	ВрТ0.Цена,
	|	ВрТ0.ЕдиницаИзмерения,
	|	ВрТ0.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВрТ1.Организация КАК Организация,
	|	ВрТ1.Район КАК Район,
	|	ВрТ1.Договор КАК Договор,
	|	ВрТ1.Контрагент КАК Контрагент,
	|	ВрТ1.Услуга КАК Услуга,
	|	ВрТ1.Количество КАК Количество,
	|	ВрТ1.Цена КАК Цена,
	|	ВрТ1.Сумма КАК Сумма,
	|	ВрТ1.НДС КАК НДС,
	|	ВрТ1.СуммаНДС КАК СуммаНДС,
	|	ВрТ1.НомерСФ КАК НомерСФ,
	|	ВрТ1.ДатаСФ КАК ДатаСФ,
	|	ВрТ1.IDАктаВыполненныхРабот КАК IDАктаВыполненныхРабот,
	|	ВрТ1.НомерАктаВыполненныхРабот КАК НомерАктаВыполненныхРабот,
	|	ВрТ1.ДатаАктаВыполненныхРабот КАК ДатаАктаВыполненныхРабот,
	|	ВрТ1.НомерСчетаНаОплату КАК НомерСчетаНаОплату,
	|	ВрТ1.ДатаСчетаНаОплату КАК ДатаСчетаНаОплату,
	|	ВрТ1.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЕСТЬNULL(бестНаименованияОрганизацийДляПечатиСрезПоследних.НаименованиеПолное, ВрТ1.Организация) КАК ОрганизацияНаименование,
	|	ЕСТЬNULL(бестНаименованияКонтрагентовДляПечатиСрезПоследних.НаименованиеПолное, ВрТ1.Контрагент) КАК КонтрагентНаименование,
	|	ВрТ1.Ссылка КАК Ссылка,
	|	бестНаименованияОрганизацийДляПечатиСрезПоследних.НаименованиеСокращённое КАК ОрганизацияНаименованиеСокр,
	|	бестНаименованияОрганизацийДляПечатиСрезПоследних.КонтрагентДляВыставленияПД КАК КонтрагентДляВыставленияПД
	|ПОМЕСТИТЬ ВрТ3
	|ИЗ
	|	ВрТ1 КАК ВрТ1
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестНаименованияОрганизацийДляПечати.СрезПоследних(&Дата, ) КАК бестНаименованияОрганизацийДляПечатиСрезПоследних
	|		ПО ВрТ1.Организация = бестНаименованияОрганизацийДляПечатиСрезПоследних.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестНаименованияКонтрагентовДляПечати.СрезПоследних(&Дата, ) КАК бестНаименованияКонтрагентовДляПечатиСрезПоследних
	|		ПО ВрТ1.Контрагент = бестНаименованияКонтрагентовДляПечатиСрезПоследних.Контрагент
	|
	|СГРУППИРОВАТЬ ПО
	|	ВрТ1.Район,
	|	ВрТ1.Контрагент,
	|	ВрТ1.НДС,
	|	ВрТ1.Организация,
	|	ВрТ1.Услуга,
	|	ВрТ1.Договор,
	|	ВрТ1.ДатаСФ,
	|	ВрТ1.IDАктаВыполненныхРабот,
	|	ВрТ1.ЕдиницаИзмерения,
	|	ВрТ1.НомерСчетаНаОплату,
	|	ВрТ1.ДатаАктаВыполненныхРабот,
	|	ВрТ1.НомерАктаВыполненныхРабот,
	|	ВрТ1.НомерСФ,
	|	ВрТ1.ДатаСчетаНаОплату,
	|	ЕСТЬNULL(бестНаименованияОрганизацийДляПечатиСрезПоследних.НаименованиеПолное, ВрТ1.Организация),
	|	ЕСТЬNULL(бестНаименованияКонтрагентовДляПечатиСрезПоследних.НаименованиеПолное, ВрТ1.Контрагент),
	|	ВрТ1.Количество,
	|	ВрТ1.Цена,
	|	ВрТ1.Сумма,
	|	ВрТ1.СуммаНДС,
	|	ВрТ1.Ссылка,
	|	бестНаименованияОрганизацийДляПечатиСрезПоследних.НаименованиеСокращённое,
	|	бестНаименованияОрганизацийДляПечатиСрезПоследних.КонтрагентДляВыставленияПД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргКонтрагенты.Ссылка КАК Контрагент,
	|	энргКонтрагенты.ИНН КАК ИНН,
	|	энргКонтрагенты.КПП КАК КПП,
	|	ЕСТЬNULL(ВЫРАЗИТЬ(бестНаименованияКонтрагентовДляПечатиСрезПоследних.НаименованиеПолное КАК СТРОКА(1024)), """") КАК НаименованиеПолное,
	|	ЕСТЬNULL(ВЫРАЗИТЬ(бестНаименованияКонтрагентовДляПечатиСрезПоследних.НаименованиеСокращённое КАК СТРОКА(1024)), """") КАК НаименованиеСокращённое
	|ПОМЕСТИТЬ СпрКонтрагенты
	|ИЗ
	|	Справочник.энргКонтрагенты КАК энргКонтрагенты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргКонтрагенты.КонтактнаяИнформация КАК энргКонтрагентыКонтактнаяИнформация
	|		ПО энргКонтрагентыКонтактнаяИнформация.Ссылка = энргКонтрагенты.Ссылка
	|			И (энргКонтрагентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресКонтрагента))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестНаименованияКонтрагентовДляПечати.СрезПоследних(&Дата, ) КАК бестНаименованияКонтрагентовДляПечатиСрезПоследних
	|		ПО бестНаименованияКонтрагентовДляПечатиСрезПоследних.Контрагент = энргКонтрагенты.Ссылка
	|ГДЕ
	|	НЕ энргКонтрагенты.ПометкаУдаления
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(ВЫРАЗИТЬ(бестНаименованияКонтрагентовДляПечатиСрезПоследних.НаименованиеСокращённое КАК СТРОКА(1024)), """"),
	|	ЕСТЬNULL(ВЫРАЗИТЬ(бестНаименованияКонтрагентовДляПечатиСрезПоследних.НаименованиеПолное КАК СТРОКА(1024)), """"),
	|	энргКонтрагенты.Ссылка,
	|	энргКонтрагенты.ИНН,
	|	энргКонтрагенты.КПП
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВрТ3.Организация КАК Организация,
	|	ВрТ3.Район КАК Район,
	|	ВрТ3.Договор КАК Договор,
	|	ВрТ3.Контрагент КАК Контрагент,
	|	ВрТ3.Услуга КАК Услуга,
	|	ВрТ3.Количество КАК Количество,
	|	ВрТ3.Цена КАК Цена,
	|	ВрТ3.Сумма КАК Сумма,
	|	ВрТ3.НДС КАК НДС,
	|	ВрТ3.СуммаНДС КАК СуммаНДС,
	|	ВрТ3.НомерСФ КАК НомерСФ,
	|	ВрТ3.ДатаСФ КАК ДатаСФ,
	|	ВрТ3.IDАктаВыполненныхРабот КАК IDАктаВыполненныхРабот,
	|	ВрТ3.НомерАктаВыполненныхРабот КАК НомерАктаВыполненныхРабот,
	|	ВрТ3.ДатаАктаВыполненныхРабот КАК ДатаАктаВыполненныхРабот,
	|	ВрТ3.НомерСчетаНаОплату КАК НомерСчетаНаОплату,
	|	ВрТ3.ДатаСчетаНаОплату КАК ДатаСчетаНаОплату,
	|	ВрТ3.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	КонтрагентыПоставщики.НаименованиеПолное КАК ОрганизацияНаименование,
	|	КонтрагентыПокупатели.НаименованиеПолное КАК КонтрагентНаименование,
	|	ВрТ3.Ссылка КАК Ссылка,
	|	КонтрагентыПоставщики.НаименованиеСокращённое КАК ОрганизацияНаименованиеСокр,
	|	ВрТ3.КонтрагентДляВыставленияПД КАК КонтрагентДляВыставленияПД,
	|	КонтрагентыПоставщики.ИНН КАК ИННПоставщик,
	|	КонтрагентыПоставщики.КПП КАК КПППоставщик,
	|	КонтрагентыПокупатели.ИНН КАК ИННПокупатель,
	|	КонтрагентыПокупатели.КПП КАК КПППокупатель
	|ПОМЕСТИТЬ ВрТ4
	|ИЗ
	|	ВрТ3 КАК ВрТ3
	|		ЛЕВОЕ СОЕДИНЕНИЕ СпрКонтрагенты КАК КонтрагентыПоставщики
	|		ПО ВрТ3.КонтрагентДляВыставленияПД = КонтрагентыПоставщики.Контрагент
	|		ЛЕВОЕ СОЕДИНЕНИЕ СпрКонтрагенты КАК КонтрагентыПокупатели
	|		ПО ВрТ3.Контрагент = КонтрагентыПокупатели.Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВрТ4.Организация КАК Организация,
	|	ВрТ4.Договор КАК Договор,
	|	ВрТ4.НомерСчетаНаОплату КАК НомерДок,
	|	ВрТ4.ДатаСчетаНаОплату КАК ДатаДок,
	|	ВрТ4.ОрганизацияНаименование КАК ПредставлениеПоставщика,
	|	ВрТ4.КонтрагентНаименование КАК ПредставлениеПолучателя,
	|	ВрТ4.Ссылка КАК Ссылка
	|ИЗ
	|	ВрТ4 КАК ВрТ4
	|
	|СГРУППИРОВАТЬ ПО
	|	ВрТ4.Договор,
	|	ВрТ4.КонтрагентНаименование,
	|	ВрТ4.НомерСчетаНаОплату,
	|	ВрТ4.Ссылка,
	|	ВрТ4.ОрганизацияНаименование,
	|	ВрТ4.Организация,
	|	ВрТ4.ДатаСчетаНаОплату
	|ИТОГИ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВрТ3.Услуга КАК Услуга,
	|	СУММА(ВрТ3.Количество) КАК Количество,
	|	ВрТ3.Цена КАК Цена,
	|	СУММА(ВрТ3.Сумма) КАК Сумма,
	|	ВрТ3.НДС КАК НДС,
	|	СУММА(ВрТ3.СуммаНДС) КАК СуммаНДС,
	|	ВрТ3.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЕСТЬNULL(бестСоответствиеУслугНоменклатуре.Номенклатура, """") КАК НоменклатураНаименование,
	|	ВрТ3.Ссылка КАК Ссылка
	|ИЗ
	|	ВрТ3 КАК ВрТ3
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестСоответствиеУслугНоменклатуре КАК бестСоответствиеУслугНоменклатуре
	|		ПО ВрТ3.Организация = бестСоответствиеУслугНоменклатуре.Организация
	|			И ВрТ3.Услуга = бестСоответствиеУслугНоменклатуре.Услуга
	|
	|СГРУППИРОВАТЬ ПО
	|	ВрТ3.НДС,
	|	ВрТ3.Услуга,
	|	ВрТ3.ЕдиницаИзмерения,
	|	ЕСТЬNULL(бестСоответствиеУслугНоменклатуре.Номенклатура, """"),
	|	ВрТ3.Цена,
	|	ВрТ3.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВрТ3.Организация КАК Организация,
	|	ЕСТЬNULL(ОтветственныеЛицаОрганизацийСрезПоследних.Должность, """") КАК Должность,
	|	ЕСТЬNULL(ОтветственныеЛицаОрганизацийСрезПоследних.ФизическоеЛицо, """") КАК ФизЛицо
	|ИЗ
	|	ВрТ3 КАК ВрТ3
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(&Дата, ) КАК ОтветственныеЛицаОрганизацийСрезПоследних
	|		ПО ВрТ3.Организация = ОтветственныеЛицаОрганизацийСрезПоследних.СтруктурнаяЕдиница
	|			И (ОтветственныеЛицаОрганизацийСрезПоследних.ПравоПодписиПлатежныхДокументов)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВрТ3.Организация,
	|	ЕСТЬNULL(ОтветственныеЛицаОрганизацийСрезПоследних.Должность, """"),
	|	ЕСТЬNULL(ОтветственныеЛицаОрганизацийСрезПоследних.ФизическоеЛицо, """")
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	ФизЛицо
	|АВТОУПОРЯДОЧИВАНИЕ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.НомерСчета КАК СчетПолучателяПредставление,
	|	Банки.Код КАК БИКБанкаПолучателя,
	|	Банки.КоррСчет КАК СчетБанкаПолучателяПредставление,
	|	Банки.Наименование КАК БанкПолучателяПредставление,
	|	ВложенныйЗапрос.ИННПолучателя КАК ИННПолучателя,
	|	ВложенныйЗапрос.КПППолучателя КАК КПППолучателя,
	|	ВложенныйЗапрос.ОрганизацияНаименованиеСокр КАК ПредставлениеПолучателя
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВрТ4.ОрганизацияНаименование КАК Организация,
	|		БанковскиеСчета.Банк КАК БанкПолучателяПредставление,
	|		БанковскиеСчета.НомерСчета КАК НомерСчета,
	|		ВрТ4.ИННПоставщик КАК ИННПолучателя,
	|		ВрТ4.КПППоставщик КАК КПППолучателя,
	|		ВрТ4.ОрганизацияНаименованиеСокр КАК ОрганизацияНаименованиеСокр
	|	ИЗ
	|		ВрТ4 КАК ВрТ4
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.БанковскиеСчета КАК БанковскиеСчета
	|			ПО ВрТ4.Организация = БанковскиеСчета.Владелец
	|				И (НЕ БанковскиеСчета.ПометкаУдаления)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		БанковскиеСчета.Банк,
	|		БанковскиеСчета.НомерСчета,
	|		ВрТ4.ОрганизацияНаименованиеСокр,
	|		ВрТ4.ИННПоставщик,
	|		ВрТ4.КПППоставщик,
	|		ВрТ4.ОрганизацияНаименование) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Банки КАК Банки
	|		ПО ВложенныйЗапрос.БанкПолучателяПредставление = Банки.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	Банки.КоррСчет,
	|	ВложенныйЗапрос.НомерСчета,
	|	ВложенныйЗапрос.КПППолучателя,
	|	ВложенныйЗапрос.Организация,
	|	Банки.Наименование,
	|	Банки.Код,
	|	ВложенныйЗапрос.ОрганизацияНаименованиеСокр,
	|	ВложенныйЗапрос.ИННПолучателя";
	
	Реализация = Запрос.ВыполнитьПакет();
	
	Возврат Реализация;
КонецФункции

Функция ПолучениеДанныхСчетаФактурыВыданный(МассивДок, ДатаПечати)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивДок", 	МассивДок);
	Запрос.УстановитьПараметр("Дата", 		ДатаПечати);
	Запрос.Текст = "ВЫБРАТЬ
	|	бестРеализацияЮрЛица.Организация КАК Организация,
	|	бестРеализацияЮрЛица.Район КАК Район,
	|	бестРеализацияЮрЛица.Договор КАК Договор,
	|	бестРеализацияЮрЛица.Контрагент КАК Контрагент,
	|	бестРеализацияЮрЛицаУслуги.Услуга КАК Услуга,
	|	бестРеализацияЮрЛицаУслуги.Количество КАК Количество,
	|	бестРеализацияЮрЛицаУслуги.Цена КАК Цена,
	|	бестРеализацияЮрЛицаУслуги.Сумма КАК Сумма,
	|	ВЫБОР
	|		КОГДА бестРеализацияЮрЛицаУслуги.НДС = ЗНАЧЕНИЕ(Перечисление.бестСтавкиНДС.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.бестСтавкиНДС.НДС20)
	|		ИНАЧЕ бестРеализацияЮрЛицаУслуги.НДС
	|	КОНЕЦ КАК НДС,
	|	бестРеализацияЮрЛицаУслуги.СуммаНДС КАК СуммаНДС,
	|	бестРеализацияЮрЛица.Ссылка КАК Ссылка,
	|	бестРеализацияЮрЛицаУслуги.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	|ПОМЕСТИТЬ ВрТ0
	|ИЗ
	|	Документ.бестРеализацияЮрЛица.Услуги КАК бестРеализацияЮрЛицаУслуги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестРеализацияЮрЛица КАК бестРеализацияЮрЛица
	|		ПО бестРеализацияЮрЛицаУслуги.Ссылка = бестРеализацияЮрЛица.Ссылка
	|ГДЕ
	|	бестРеализацияЮрЛица.Ссылка В(&МассивДок)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВрТ0.Организация КАК Организация,
	|	ВрТ0.Район КАК Район,
	|	ВрТ0.Договор КАК Договор,
	|	ВрТ0.Контрагент КАК Контрагент,
	|	ВрТ0.Услуга КАК Услуга,
	|	СУММА(ВрТ0.Количество) КАК Количество,
	|	ВрТ0.Цена КАК Цена,
	|	СУММА(ВрТ0.Сумма) КАК Сумма,
	|	ВрТ0.НДС КАК НДС,
	|	СУММА(ВрТ0.СуммаНДС) КАК СуммаНДС,
	|	бестНомераСчетовФактурНачисленийЮрЛиц.НомерСФ КАК НомерСФ,
	|	бестНомераСчетовФактурНачисленийЮрЛиц.ДатаСФ КАК ДатаСФ,
	|	бестНомераСчетовФактурНачисленийЮрЛиц.IDАктаВыполненныхРабот КАК IDАктаВыполненныхРабот,
	|	бестНомераСчетовФактурНачисленийЮрЛиц.НомерАктаВыполненныхРабот КАК НомерАктаВыполненныхРабот,
	|	бестНомераСчетовФактурНачисленийЮрЛиц.ДатаАктаВыполненныхРабот КАК ДатаАктаВыполненныхРабот,
	|	бестНомераСчетовФактурНачисленийЮрЛиц.НомерСчетаНаОплату КАК НомерСчетаНаОплату,
	|	бестНомераСчетовФактурНачисленийЮрЛиц.ДатаСчетаНаОплату КАК ДатаСчетаНаОплату,
	|	ВрТ0.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВрТ0.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВрТ1
	|ИЗ
	|	ВрТ0 КАК ВрТ0
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестНомераСчетовФактурНачисленийЮрЛиц КАК бестНомераСчетовФактурНачисленийЮрЛиц
	|		ПО ВрТ0.Организация = бестНомераСчетовФактурНачисленийЮрЛиц.Организация
	|			И ВрТ0.Ссылка = бестНомераСчетовФактурНачисленийЮрЛиц.Начисление
	|
	|СГРУППИРОВАТЬ ПО
	|	ВрТ0.НДС,
	|	ВрТ0.Договор,
	|	ВрТ0.Услуга,
	|	ВрТ0.Контрагент,
	|	ВрТ0.Организация,
	|	ВрТ0.Район,
	|	бестНомераСчетовФактурНачисленийЮрЛиц.ДатаСчетаНаОплату,
	|	бестНомераСчетовФактурНачисленийЮрЛиц.НомерСФ,
	|	бестНомераСчетовФактурНачисленийЮрЛиц.НомерСчетаНаОплату,
	|	бестНомераСчетовФактурНачисленийЮрЛиц.ДатаСФ,
	|	бестНомераСчетовФактурНачисленийЮрЛиц.НомерАктаВыполненныхРабот,
	|	бестНомераСчетовФактурНачисленийЮрЛиц.IDАктаВыполненныхРабот,
	|	бестНомераСчетовФактурНачисленийЮрЛиц.ДатаАктаВыполненныхРабот,
	|	ВрТ0.Цена,
	|	ВрТ0.ЕдиницаИзмерения,
	|	ВрТ0.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВрТ1.Организация КАК Организация,
	|	ВрТ1.Район КАК Район,
	|	ВрТ1.Договор КАК Договор,
	|	ВрТ1.Контрагент КАК Контрагент,
	|	ВрТ1.Услуга КАК Услуга,
	|	ВрТ1.Количество КАК Количество,
	|	ВрТ1.Цена КАК Цена,
	|	ВрТ1.Сумма КАК Сумма,
	|	ВрТ1.НДС КАК НДС,
	|	ВрТ1.СуммаНДС КАК СуммаНДС,
	|	ВрТ1.НомерСФ КАК НомерСФ,
	|	ВрТ1.ДатаСФ КАК ДатаСФ,
	|	ВрТ1.IDАктаВыполненныхРабот КАК IDАктаВыполненныхРабот,
	|	ВрТ1.НомерАктаВыполненныхРабот КАК НомерАктаВыполненныхРабот,
	|	ВрТ1.ДатаАктаВыполненныхРабот КАК ДатаАктаВыполненныхРабот,
	|	ВрТ1.НомерСчетаНаОплату КАК НомерСчетаНаОплату,
	|	ВрТ1.ДатаСчетаНаОплату КАК ДатаСчетаНаОплату,
	|	ВрТ1.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЕСТЬNULL(бестНаименованияОрганизацийДляПечатиСрезПоследних.НаименованиеПолное, ВрТ1.Организация) КАК ОрганизацияНаименование,
	|	ВрТ1.Ссылка КАК Ссылка,
	|	бестНаименованияОрганизацийДляПечатиСрезПоследних.НаименованиеСокращённое КАК ОрганизацияНаименованиеСокр,
	|	энргЕдиницыИзмерения.Код КАК КодЕдИзм,
	|	ЕСТЬNULL(бестНаименованияОрганизацийДляПечатиСрезПоследних.КонтрагентДляВыставленияПД, ЗНАЧЕНИЕ(Справочник.энргКонтрагенты.ПустаяСсылка)) КАК КонтрагентДляВыставленияПД
	|ПОМЕСТИТЬ ВрТ3
	|ИЗ
	|	ВрТ1 КАК ВрТ1
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестНаименованияОрганизацийДляПечати.СрезПоследних(&Дата, ) КАК бестНаименованияОрганизацийДляПечатиСрезПоследних
	|		ПО ВрТ1.Организация = бестНаименованияОрганизацийДляПечатиСрезПоследних.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргЕдиницыИзмерения КАК энргЕдиницыИзмерения
	|		ПО ВрТ1.ЕдиницаИзмерения = энргЕдиницыИзмерения.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВрТ1.Район,
	|	ВрТ1.Контрагент,
	|	ВрТ1.НДС,
	|	ВрТ1.Организация,
	|	ВрТ1.Услуга,
	|	ВрТ1.Договор,
	|	ВрТ1.ДатаСФ,
	|	ВрТ1.IDАктаВыполненныхРабот,
	|	ВрТ1.ЕдиницаИзмерения,
	|	ВрТ1.НомерСчетаНаОплату,
	|	ВрТ1.ДатаАктаВыполненныхРабот,
	|	ВрТ1.НомерАктаВыполненныхРабот,
	|	ВрТ1.НомерСФ,
	|	ВрТ1.ДатаСчетаНаОплату,
	|	ЕСТЬNULL(бестНаименованияОрганизацийДляПечатиСрезПоследних.НаименованиеПолное, ВрТ1.Организация),
	|	ВрТ1.Количество,
	|	ВрТ1.Цена,
	|	ВрТ1.Сумма,
	|	ВрТ1.СуммаНДС,
	|	ВрТ1.Ссылка,
	|	бестНаименованияОрганизацийДляПечатиСрезПоследних.НаименованиеСокращённое,
	|	энргЕдиницыИзмерения.Код,
	|	ЕСТЬNULL(бестНаименованияОрганизацийДляПечатиСрезПоследних.КонтрагентДляВыставленияПД, ЗНАЧЕНИЕ(Справочник.энргКонтрагенты.ПустаяСсылка))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргКонтрагенты.Ссылка КАК Контрагент,
	|	энргКонтрагенты.ИНН КАК ИНН,
	|	энргКонтрагенты.КПП КАК КПП,
	|	ВЫРАЗИТЬ(энргКонтрагентыКонтактнаяИнформация.Представление КАК СТРОКА(1024)) КАК Адрес,
	|	ЕСТЬNULL(ВЫРАЗИТЬ(бестНаименованияКонтрагентовДляПечатиСрезПоследних.НаименованиеПолное КАК СТРОКА(1024)), """") КАК НаименованиеПолное,
	|	ЕСТЬNULL(ВЫРАЗИТЬ(бестНаименованияКонтрагентовДляПечатиСрезПоследних.НаименованиеСокращённое КАК СТРОКА(512)), """") КАК НаименованиеСокращённое
	|ПОМЕСТИТЬ СпрКонтрагенты
	|ИЗ
	|	Справочник.энргКонтрагенты КАК энргКонтрагенты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргКонтрагенты.КонтактнаяИнформация КАК энргКонтрагентыКонтактнаяИнформация
	|		ПО (энргКонтрагентыКонтактнаяИнформация.Ссылка = энргКонтрагенты.Ссылка)
	|			И (энргКонтрагентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресКонтрагента))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестНаименованияКонтрагентовДляПечати.СрезПоследних КАК бестНаименованияКонтрагентовДляПечатиСрезПоследних
	|		ПО (бестНаименованияКонтрагентовДляПечатиСрезПоследних.Контрагент = энргКонтрагенты.Ссылка)
	|ГДЕ
	|	НЕ энргКонтрагенты.ПометкаУдаления
	|
	|СГРУППИРОВАТЬ ПО
	|	энргКонтрагенты.Ссылка,
	|	энргКонтрагенты.ИНН,
	|	энргКонтрагенты.КПП,
	|	ВЫРАЗИТЬ(энргКонтрагентыКонтактнаяИнформация.Представление КАК СТРОКА(1024)),
	|	ЕСТЬNULL(ВЫРАЗИТЬ(бестНаименованияКонтрагентовДляПечатиСрезПоследних.НаименованиеПолное КАК СТРОКА(1024)), """"),
	|	ЕСТЬNULL(ВЫРАЗИТЬ(бестНаименованияКонтрагентовДляПечатиСрезПоследних.НаименованиеСокращённое КАК СТРОКА(512)), """")
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВрТ3.Организация КАК Организация,
	|	ВрТ3.Район КАК Район,
	|	ВрТ3.Договор КАК Договор,
	|	ВрТ3.Контрагент КАК Контрагент,
	|	ВрТ3.Услуга КАК Услуга,
	|	ВрТ3.Количество КАК Количество,
	|	ВрТ3.Цена КАК Цена,
	|	ВрТ3.Сумма КАК Сумма,
	|	ВрТ3.НДС КАК НДС,
	|	ВрТ3.СуммаНДС КАК СуммаНДС,
	|	ВрТ3.НомерСФ КАК НомерСФ,
	|	ВрТ3.ДатаСФ КАК ДатаСФ,
	|	ВрТ3.НомерАктаВыполненныхРабот КАК НомерАктаВыполненныхРабот,
	|	ВрТ3.ДатаАктаВыполненныхРабот КАК ДатаАктаВыполненныхРабот,
	|	ВрТ3.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	КонтрагентыПоставщики.НаименованиеПолное КАК ОрганизацияНаименование,
	|	КонтрагентыПокупатели.НаименованиеПолное КАК КонтрагентНаименование,
	|	ВрТ3.Ссылка КАК Ссылка,
	|	ВрТ3.ОрганизацияНаименованиеСокр КАК ОрганизацияНаименованиеСокр,
	|	ВрТ3.КодЕдИзм КАК КодЕдИзм,
	|	ВрТ3.КонтрагентДляВыставленияПД КАК КонтрагентПоставщик,
	|	КонтрагентыПоставщики.ИНН КАК ИННПоставщик,
	|	КонтрагентыПоставщики.КПП КАК КПППоставщик,
	|	КонтрагентыПоставщики.Адрес КАК АдресПоставщик,
	|	КонтрагентыПокупатели.ИНН КАК ИННПокупатель,
	|	КонтрагентыПокупатели.КПП КАК КПППокупатель,
	|	КонтрагентыПокупатели.Адрес КАК АдресПокупатель
	|ПОМЕСТИТЬ ВрТ4
	|ИЗ
	|	ВрТ3 КАК ВрТ3
	|		ЛЕВОЕ СОЕДИНЕНИЕ СпрКонтрагенты КАК КонтрагентыПоставщики
	|		ПО ВрТ3.КонтрагентДляВыставленияПД = КонтрагентыПоставщики.Контрагент
	|		ЛЕВОЕ СОЕДИНЕНИЕ СпрКонтрагенты КАК КонтрагентыПокупатели
	|		ПО ВрТ3.Контрагент = КонтрагентыПокупатели.Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВрТ4.Ссылка КАК Ссылка,
	|	ВрТ4.Организация КАК Организация,
	|	ВрТ4.Договор КАК Договор,
	|	ВрТ4.НомерСФ КАК НомерДок,
	|	ВрТ4.ДатаСФ КАК ДатаДок,
	|	ВрТ4.ОрганизацияНаименование КАК ПредставлениеПоставщика,
	|	ВрТ4.КонтрагентНаименование КАК ПредставлениеПолучателя,
	|	ВрТ4.НомерАктаВыполненныхРабот КАК НомерАкта,
	|	ВрТ4.ДатаАктаВыполненныхРабот КАК ДатаАкта,
	|	ВрТ4.ИННПоставщик КАК ИННПоставщик,
	|	ВрТ4.КПППоставщик КАК КПППоставщик,
	|	ВрТ4.АдресПоставщик КАК АдресПоставщик,
	|	ВрТ4.ИННПокупатель КАК ИННПокупатель,
	|	ВрТ4.КПППокупатель КАК КПППокупатель,
	|	ВрТ4.АдресПокупатель КАК АдресПокупатель
	|ИЗ
	|	ВрТ4 КАК ВрТ4
	|
	|СГРУППИРОВАТЬ ПО
	|	ВрТ4.Организация,
	|	ВрТ4.НомерСФ,
	|	ВрТ4.Договор,
	|	ВрТ4.Ссылка,
	|	ВрТ4.НомерАктаВыполненныхРабот,
	|	ВрТ4.ДатаСФ,
	|	ВрТ4.ОрганизацияНаименование,
	|	ВрТ4.КонтрагентНаименование,
	|	ВрТ4.ДатаАктаВыполненныхРабот,
	|	ВрТ4.ИННПоставщик,
	|	ВрТ4.КПППоставщик,
	|	ВрТ4.АдресПоставщик,
	|	ВрТ4.ИННПокупатель,
	|	ВрТ4.КПППокупатель,
	|	ВрТ4.АдресПокупатель
	|ИТОГИ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВрТ3.Услуга КАК Услуга,
	|	СУММА(ВрТ3.Количество) КАК Количество,
	|	ВрТ3.Цена КАК Цена,
	|	СУММА(ВрТ3.Сумма) КАК Стоимость,
	|	ВрТ3.НДС КАК СтавкаНДС,
	|	СУММА(ВрТ3.СуммаНДС) КАК СуммаНДС,
	|	ВрТ3.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЕСТЬNULL(бестСоответствиеУслугНоменклатуре.Номенклатура, """") КАК НоменклатураНаименование,
	|	ВрТ3.Ссылка КАК Ссылка,
	|	ВрТ3.КодЕдИзм КАК ЕдиницаИзмеренияКод
	|ИЗ
	|	ВрТ3 КАК ВрТ3
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бестСоответствиеУслугНоменклатуре КАК бестСоответствиеУслугНоменклатуре
	|		ПО ВрТ3.Организация = бестСоответствиеУслугНоменклатуре.Организация
	|			И ВрТ3.Услуга = бестСоответствиеУслугНоменклатуре.Услуга
	|
	|СГРУППИРОВАТЬ ПО
	|	ВрТ3.НДС,
	|	ВрТ3.Услуга,
	|	ВрТ3.ЕдиницаИзмерения,
	|	ЕСТЬNULL(бестСоответствиеУслугНоменклатуре.Номенклатура, """"),
	|	ВрТ3.Цена,
	|	ВрТ3.Ссылка,
	|	ВрТ3.КодЕдИзм
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВрТ3.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА ОтветственныеЛицаОрганизацийСрезПоследних.ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.ОтветственныеЛицаОрганизаций.Руководитель)
	|			ТОГДА ЕСТЬNULL(ОтветственныеЛицаОрганизацийСрезПоследних.ФизическоеЛицо, """")
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ФИОРуководителя,
	|	ВЫБОР
	|		КОГДА ОтветственныеЛицаОрганизацийСрезПоследних.ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер)
	|			ТОГДА ЕСТЬNULL(ОтветственныеЛицаОрганизацийСрезПоследних.ФизическоеЛицо, """")
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ФИОГлавногоБухгалтера
	|ИЗ
	|	ВрТ3 КАК ВрТ3
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(&Дата, ) КАК ОтветственныеЛицаОрганизацийСрезПоследних
	|		ПО ВрТ3.Организация = ОтветственныеЛицаОрганизацийСрезПоследних.СтруктурнаяЕдиница
	|
	|СГРУППИРОВАТЬ ПО
	|	ВрТ3.Организация,
	|	ВЫБОР
	|		КОГДА ОтветственныеЛицаОрганизацийСрезПоследних.ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.ОтветственныеЛицаОрганизаций.Руководитель)
	|			ТОГДА ЕСТЬNULL(ОтветственныеЛицаОрганизацийСрезПоследних.ФизическоеЛицо, """")
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ОтветственныеЛицаОрганизацийСрезПоследних.ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер)
	|			ТОГДА ЕСТЬNULL(ОтветственныеЛицаОрганизацийСрезПоследних.ФизическоеЛицо, """")
	|		ИНАЧЕ """"
	|	КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	ФИОРуководителя
	|АВТОУПОРЯДОЧИВАНИЕ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.НомерСчета КАК СчетПолучателяПредставление,
	|	Банки.Код КАК БИКБанкаПолучателя,
	|	Банки.КоррСчет КАК СчетБанкаПолучателяПредставление,
	|	Банки.Наименование КАК БанкПолучателяПредставление,
	|	ВложенныйЗапрос.ИННПолучателя КАК ИННПолучателя,
	|	ВложенныйЗапрос.КПППолучателя КАК КПППолучателя,
	|	ВложенныйЗапрос.ОрганизацияНаименованиеСокр КАК ПредставлениеПолучателя
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВрТ3.Организация КАК Организация,
	|		БанковскиеСчета.Банк КАК БанкПолучателяПредставление,
	|		БанковскиеСчета.НомерСчета КАК НомерСчета,
	|		Организации.ИНН КАК ИННПолучателя,
	|		Организации.КПП КАК КПППолучателя,
	|		ВрТ3.ОрганизацияНаименованиеСокр КАК ОрганизацияНаименованиеСокр
	|	ИЗ
	|		ВрТ3 КАК ВрТ3
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.БанковскиеСчета КАК БанковскиеСчета
	|			ПО ВрТ3.Организация = БанковскиеСчета.Владелец
	|				И (НЕ БанковскиеСчета.ПометкаУдаления)
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|			ПО ВрТ3.Организация = Организации.Ссылка
	|	
	|	СГРУППИРОВАТЬ ПО
	|		БанковскиеСчета.Банк,
	|		БанковскиеСчета.НомерСчета,
	|		ВрТ3.Организация,
	|		Организации.КПП,
	|		Организации.ИНН,
	|		ВрТ3.ОрганизацияНаименованиеСокр) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Банки КАК Банки
	|		ПО ВложенныйЗапрос.БанкПолучателяПредставление = Банки.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	Банки.КоррСчет,
	|	ВложенныйЗапрос.НомерСчета,
	|	ВложенныйЗапрос.КПППолучателя,
	|	ВложенныйЗапрос.Организация,
	|	Банки.Наименование,
	|	Банки.Код,
	|	ВложенныйЗапрос.ОрганизацияНаименованиеСокр,
	|	ВложенныйЗапрос.ИННПолучателя";
	
	Реализация = Запрос.ВыполнитьПакет();
	
	Возврат Реализация;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ФормированиеПечатнойФормыАктаВыполненныхРабот(МассивДок, ТабДок, ДатаПечати) Экспорт
	Макет						= УправлениеПечатью.МакетПечатнойФормы("Документ.бестРеализацияЮрЛица.ПФ_MXL_Акт");
	НаборДанных					= ПолучениеДанныхАктаВыполненныхРабот(МассивДок, ДатаПечати);
	
	ВЫборкаШапка 				= НаборДанных[5].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВЫборкаТЧ 					= НаборДанных[6].Выгрузить();
	ВЫборкаОтветственные 		= НаборДанных[7].Выгрузить();
	
	Пока ВЫборкаШапка.Следующий() Цикл
		ТеДок			= ВЫборкаШапка.Ссылка;
		ВыборкаДанные 	= ВЫборкаШапка.Выбрать();
		Пока ВыборкаДанные.Следующий() Цикл
			ТекДоговор 	= ВыборкаДанные.Договор;
			
			ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
			ОбластьЗаголовок.Параметры.ТекстЗаголовка = "Акт №" + ВыборкаДанные.НомерДок + " от " + Формат(ВыборкаДанные.ДатаДок, "ДЛФ=DD");
			ТабДок.Вывести(ОбластьЗаголовок);
			
			ОбластьПоставщик = Макет.ПолучитьОбласть("Поставщик");
			ОбластьПоставщик.Параметры.Заполнить(ВыборкаДанные);
			ТабДок.Вывести(ОбластьПоставщик);
			
			ОбластьПолучатель = Макет.ПолучитьОбласть("Получатель");
			ОбластьПолучатель.Параметры.Заполнить(ВыборкаДанные);
			ТабДок.Вывести(ОбластьПолучатель);
			
			ОбластьШапкаТЧ = Макет.ПолучитьОбласть("ШапкаТаблицы");
			ТабДок.Вывести(ОбластьШапкаТЧ);
			
			СуммаВсего	= 0;
			СуммаНДСВсего	= 0;
			ИщемСтроки = ВЫборкаТЧ.НайтиСтроки(Новый Структура("Ссылка", ТеДок));
			Для строка = 0 по ИщемСтроки.ВГраница() Цикл
				ОбластьСтрокаТЧ = Макет.ПолучитьОбласть("Строка");
				ОбластьСтрокаТЧ.Параметры.Заполнить(ИщемСтроки[строка]);
				ОбластьСтрокаТЧ.Параметры.НоменклатураНаименование = Строка(ИщемСтроки[строка].НоменклатураНаименование) + " по договору '" + Строка(ТекДоговор) + "'";
				ТабДок.Вывести(ОбластьСтрокаТЧ);
				
				СуммаВсего = СуммаВсего + ИщемСтроки[строка].Сумма;
				СуммаНДСВсего = СуммаНДСВсего + ИщемСтроки[строка].СуммаНДС;
			КонецЦикла;
			
			ОбластьИтого = Макет.ПолучитьОбласть("Итого");
			ОбластьИтого.Параметры.Всего = СуммаВсего;
			ТабДок.Вывести(ОбластьИтого);	
			
			ОбластьИтогоНДС = Макет.ПолучитьОбласть("ИтогоНДС");
			ОбластьИтогоНДС.Параметры.НДС		= "Сумма НДС ";
			ОбластьИтогоНДС.Параметры.ВсегоНДС	= СуммаНДСВсего;
			ТабДок.Вывести(ОбластьИтогоНДС);
			
			ОбластьСуммаПрописью = Макет.ПолучитьОбласть("СуммаПрописью");
			ОбщаяСумма = СуммаВсего + СуммаНДСВсего;
			ОбластьСуммаПрописью.Параметры.ИтоговаяСтрока		= "Всего оказано услуг " + ИщемСтроки.Количество() + ", на сумму " + Строка(ОбщаяСумма) + " руб.";
			ФормСтрока = "Л = ru_RU; ДП = Истина";
			ПарПредмета= "рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2";
			ОбластьСуммаПрописью.Параметры.СуммаПрописью		= ЧислоПрописью(ОбщаяСумма, ФормСтрока, ПарПредмета);;
			ТабДок.Вывести(ОбластьСуммаПрописью);
			
			ИщемОтвЛиц = ВЫборкаОтветственные.НайтиСтроки(Новый Структура("Организация", ВыборкаДанные.Организация));
			Для строка = 0 по ИщемОтвЛиц.ВГраница() Цикл
				ОбластьПодписи = Макет.ПолучитьОбласть("Подписи");
				ОбластьПодписи.Параметры.ДолжностьИНазваниеОрганизации = Строка(ИщемОтвЛиц[строка].Должность) + " " + Строка(ВыборкаДанные.ПредставлениеПоставщика);
				ОбластьПодписи.Параметры.ФизЛицо = Строка(ИщемОтвЛиц[строка].ФизЛицо);
				ТабДок.Вывести(ОбластьПодписи);
			КонецЦикла;
		КонецЦикла;
		ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
		ТабДок.ВывестиГоризонтальныйРазделительСтраниц();		
	КонецЦикла;
КонецПроцедуры	

Процедура ФормированиеПечатнойФормыСчетаНаОплату(МассивДок, ТабДок, ДатаПечати) Экспорт
	Макет					= УправлениеПечатью.МакетПечатнойФормы("Документ.бестРеализацияЮрЛица.ПФ_MXL_СчетЗаказ");
	НаборДанных				= ПолучениеДанныхСчетаНаОплату(МассивДок, ДатаПечати);
	
	ВЫборкаШапка 			= НаборДанных[5].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВЫборкаТЧ 				= НаборДанных[6].Выгрузить();
	ВЫборкаОтветственные 	= НаборДанных[7].Выгрузить();
	ВЫборкаБанкРекв			= НаборДанных[8].Выгрузить();
	
	Пока ВЫборкаШапка.Следующий() Цикл
		ТеДок			= ВЫборкаШапка.Ссылка;
		ВыборкаДанные 	= ВЫборкаШапка.Выбрать();
		Пока ВыборкаДанные.Следующий() Цикл
			ТекДоговор 	= ВыборкаДанные.Договор;
			
			ОбластьВнимание = Макет.ПолучитьОбласть("Внимание");
			ТабДок.Вывести(ОбластьВнимание);
			
			ИщемБанкРеквизиты = ВЫборкаБанкРекв.НайтиСтроки(Новый Структура("Организация", ВыборкаДанные.Организация));
			Для строка = 0 по ИщемБанкРеквизиты.ВГРаница() Цикл
				ОбластьЗаголовокСчета = Макет.ПолучитьОбласть("ЗаголовокСчета");
				ОбластьЗаголовокСчета.Параметры.Заполнить(ИщемБанкРеквизиты[строка]);
				ТабДок.Вывести(ОбластьЗаголовокСчета);
			КонецЦикла;
			
			ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
			ОбластьЗаголовок.Параметры.ТекстЗаголовка = "Счет на оплату №" + ВыборкаДанные.НомерДок + " от " + Формат(ВыборкаДанные.ДатаДок, "ДЛФ=DD");
			ТабДок.Вывести(ОбластьЗаголовок);
			
			ОбластьПоставщик = Макет.ПолучитьОбласть("Поставщик");
			ОбластьПоставщик.Параметры.Заполнить(ВыборкаДанные);
			ТабДок.Вывести(ОбластьПоставщик);
			
			ОбластьПолучатель = Макет.ПолучитьОбласть("Покупатель");
			ОбластьПолучатель.Параметры.Заполнить(ВыборкаДанные);
			ТабДок.Вывести(ОбластьПолучатель);
			
			ОбластьШапкаТЧ = Макет.ПолучитьОбласть("ШапкаТаблицы");
			ТабДок.Вывести(ОбластьШапкаТЧ);
			
			СуммаВсего	= 0;
			СуммаНДСВсего	= 0;
			ИщемСтроки = ВЫборкаТЧ.НайтиСтроки(Новый Структура("Ссылка", ТеДок));
			Для строка = 0 по ИщемСтроки.ВГраница() Цикл
				ОбластьСтрокаТЧ = Макет.ПолучитьОбласть("Строка");
				ОбластьСтрокаТЧ.Параметры.Заполнить(ИщемСтроки[строка]);
				ОбластьСтрокаТЧ.Параметры.НомерСтроки = строка + 1;
				ОбластьСтрокаТЧ.Параметры.НоменклатураНаименование = Строка(ИщемСтроки[строка].НоменклатураНаименование) 
				+ " по договору '" + Строка(ТекДоговор) + "'" + " за " + Строка(Формат(ТеДок.ПериодНачисления, "ДФ='ММММ ггг'"));
				ТабДок.Вывести(ОбластьСтрокаТЧ);
				
				СуммаВсего = СуммаВсего + ИщемСтроки[строка].Сумма;
				СуммаНДСВсего = СуммаНДСВсего + ИщемСтроки[строка].СуммаНДС;
			КонецЦикла;
			
			ОбластьИтого = Макет.ПолучитьОбласть("Итого");
			ОбластьИтого.Параметры.Всего = СуммаВсего;
			ТабДок.Вывести(ОбластьИтого);	
			
			ОбластьИтогоНДС = Макет.ПолучитьОбласть("ИтогоНДС");
			ОбластьИтогоНДС.Параметры.НДС		= "Сумма НДС";
			ОбластьИтогоНДС.Параметры.ВсегоНДС	= СуммаНДСВсего;
			ТабДок.Вывести(ОбластьИтогоНДС);
			
			ОбщаяСумма = СуммаВсего + СуммаНДСВсего;
			
			ОбластьИтогоКОплате = Макет.ПолучитьОбласть("ИтогоКОплате");
			ОбластьИтогоКОплате.Параметры.ИтогоКОплате = ОбщаяСумма;
			ТабДок.Вывести(ОбластьИтогоКОплате);
			
			ОбластьСуммаПрописью = Макет.ПолучитьОбласть("СуммаПрописью");
			
			ОбластьСуммаПрописью.Параметры.ИтоговаяСтрока		= "Всего наименований " + ИщемСтроки.Количество() + ", на сумму " + Строка(ОбщаяСумма) + " руб.";
			ФормСтрока = "Л = ru_RU; ДП = Истина";
			ПарПредмета= "рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2";
			ОбластьСуммаПрописью.Параметры.СуммаПрописью		= ЧислоПрописью(ОбщаяСумма, ФормСтрока, ПарПредмета);;
			ТабДок.Вывести(ОбластьСуммаПрописью);
			
			ИщемОтвЛиц = ВЫборкаОтветственные.НайтиСтроки(Новый Структура("Организация", ВыборкаДанные.Организация));
			Для строка = 0 по ИщемОтвЛиц.ВГраница() Цикл
				ОбластьПодписи = Макет.ПолучитьОбласть("ПодвалСчета");
				ОбластьПодписи.Параметры.Должность = Строка(ИщемОтвЛиц[строка].Должность);
				ОбластьПодписи.Параметры.ФизЛицо = Строка(ИщемОтвЛиц[строка].ФизЛицо);
				ТабДок.Вывести(ОбластьПодписи);
			КонецЦикла;
		КонецЦикла;
		ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
		ТабДок.ВывестиГоризонтальныйРазделительСтраниц();		
	КонецЦикла;	
КонецПроцедуры

Процедура ФормированиеПечатнойФормыСчетаФактурыВыданный(МассивДок, ТабДок, ДатаПечати) Экспорт
	Макет															= УправлениеПечатью.МакетПечатнойФормы("Документ.бестРеализацияЮрЛица.ПФ_MXL_СчетФактура981");
	НаборДанных														= ПолучениеДанныхСчетаФактурыВыданный(МассивДок, ДатаПечати);
	
	ВЫборкаШапка 													= НаборДанных[5].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВЫборкаТЧ 														= НаборДанных[6].Выгрузить();
	ВЫборкаОтветственные 											= НаборДанных[7].Выгрузить();
	ВЫборкаБанкРекв													= НаборДанных[8].Выгрузить();
	
	Пока ВЫборкаШапка.Следующий() Цикл
		ТеДок														= ВЫборкаШапка.Ссылка;
		ОбластьШапка 												= Макет.ПолучитьОбласть("Шапка");		
		ВыборкаДанные 												= ВЫборкаШапка.Выбрать();
		
		Пока ВыборкаДанные.Следующий() Цикл
			ТекДоговор 												= ВыборкаДанные.Договор;
			
			ОбластьШапка.Параметры.НомерДок 						= ВыборкаДанные.НомерДок;
			ОбластьШапка.Параметры.НомерДок 						= Формат(ВыборкаДанные.ДатаДок, "ДЛФ=DD");
			ОбластьШапка.Параметры.ДатаДокИспр 						= "--";
			ОбластьШапка.Параметры.НомерДокИспр						= "--";
			ОбластьШапка.Параметры.ПредставлениеПоставщика 			= "Продавец: " + ВыборкаДанные.ПредставлениеПоставщика;
			ОбластьШапка.Параметры.АдресПоставщика 					= "Адрес: " + ВыборкаДанные.АдресПоставщик;
			ОбластьШапка.Параметры.ИННПоставщика 					= "ИНН/КПП продавца:" + ВыборкаДанные.ИННПоставщик + "/" + ВыборкаДанные.КПППоставщик;
			ОбластьШапка.Параметры.ПредставлениеГрузоотправителя	= "Грузоотправитель и его адрес: --";
			ОбластьШапка.Параметры.ПредставлениеГрузополучателя 	= "Грузополучатель и его адрес: --";
			ОбластьШапка.Параметры.ПоДокументу 						= "К платежно-расчетному документу № " + ВыборкаДанные.НомерАкта + " от " + Формат(ВыборкаДанные.ДатаАкта, "ДЛФ=DD");
			ОбластьШапка.Параметры.ПредставлениеПокупателя 			= "Покупатель: " + ВыборкаДанные.ПредставлениеПолучателя;
			ОбластьШапка.Параметры.АдресПокупателя 					= "Адрес: "  + ВыборкаДанные.АдресПокупатель;
			ОбластьШапка.Параметры.ИННПокупателя 					= "ИНН/КПП покупателя: " + ВыборкаДанные.ИННПокупатель + "/" + ВыборкаДанные.КПППокупатель;
			ОбластьШапка.Параметры.Валюта 							= "Валюта: наименование, код Российский рубль, 643";
			ТабДок.Вывести(ОбластьШапка);
			
			ОбластьИдентификаторГК 									= Макет.ПолучитьОбласть("ИдентификаторГосКонтракта");
			ОбластьИдентификаторГК.Параметры.ИдентификаторГосКонтракта = "Идентификатор государственного контракта, договора (соглашения) (при наличии):";
			ТабДок.Вывести(ОбластьИдентификаторГК);
			
			ОбластьШапкаТЧ 											= Макет.ПолучитьОбласть("ШапкаТаблицы");
			ТабДок.Вывести(ОбластьШапкаТЧ);
			
			СуммаВсего												= 0;
			СуммаНДСВсего											= 0;
			ИщемСтроки 												= ВЫборкаТЧ.НайтиСтроки(Новый Структура("Ссылка", ТеДок));
			Для строка = 0 по ИщемСтроки.ВГраница() Цикл
				ОбластьСтрокаТЧ 									= Макет.ПолучитьОбласть("Строка");
				ОбластьСтрокаТЧ.Параметры.Заполнить(ИщемСтроки[строка]);
				ОбластьСтрокаТЧ.Параметры.ТоварНаименование 		= Строка(ИщемСтроки[строка].НоменклатураНаименование) 
				+ " по договору '" + Строка(ТекДоговор) + "'" + " за " + Строка(Формат(ТеДок.ПериодНачисления, "ДФ='ММММ гггг'"));
				ТабДок.Вывести(ОбластьСтрокаТЧ);
				
				СуммаВсего 											= СуммаВсего + ИщемСтроки[строка].Стоимость;
				СуммаНДСВсего 										= СуммаНДСВсего + ИщемСтроки[строка].СуммаНДС;
			КонецЦикла;
			
			ОбластьИтого 											= Макет.ПолучитьОбласть("Итого");
			ОбластьИтого.Параметры.ИтогоСтоимость 					= СуммаВсего;
			ОбластьИтого.Параметры.ИтогоСуммаНДС 					= СуммаНДСВсего;
			ОбластьИтого.Параметры.ИтогоВсего 						= СуммаВсего;
			ТабДок.Вывести(ОбластьИтого);	
			
			ИщемОтвЛиц = ВЫборкаОтветственные.НайтиСтроки(Новый Структура("Организация", ВыборкаДанные.Организация));
			Для строка = 0 по ИщемОтвЛиц.ВГраница() Цикл
				ОбластьПодписи 										= Макет.ПолучитьОбласть("Подвал");
				ОбластьПодписи.Параметры.ФИОРуководителя			= Строка(ИщемОтвЛиц[строка].ФИОРуководителя);
				ОбластьПодписи.Параметры.ФИОГлавногоБухгалтера		= Строка(ИщемОтвЛиц[строка].ФИОГлавногоБухгалтера);
				ТабДок.Вывести(ОбластьПодписи);
			КонецЦикла;
		КонецЦикла;
		ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
		ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЦикла;	
КонецПроцедуры

Процедура ФормированиеПечатнойФормыКорректировочногоСчетаФактурыВыданного(МассивДок, ТабДок) Экспорт
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
